# TextBoxVisibility Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TextBoxVisibility Property
ParameterTypeId Class See Also
---
"Show Border"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TextBoxVisibility { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TextBoxVisibility As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TextBoxVisibility {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace